In [17]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "groups":["A","B","C","A","B","C"],
        "var1" : [10,23,33,22,11,99],
        "var2" : [100,253,333,262,111,23],
    },
    columns = ["groups","var1","var2"]
)
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99    23

In [18]:
def filter_func(x):
    return x["var1"].std() > 9

In [19]:
df.groupby("groups").std()

             var1        var2
groups
A        8.485281  114.551299
B        8.485281  100.409163
C       46.669048  219.203102

In [20]:
df.groupby("groups").filter(filter_func) # var1'e göre filtreliyoruz. standart yapması 9'dan büyük olan grubu getirdi

  groups  var1  var2
2      C    33   333
5      C    99    23